import {Pizza} from '../store/storeActionPizza.tsx';



export const pizzaData: Array<Pizza> = [
    {
        id: 1,
        name: 'Піца Норвезька (460г)',
        price: 349,
        img: 'https://mafia.ua/storage/image-storage/2025/02/18/95033/source/480x0/55d7ecec-3cea-45e4-ac8b-ba968837427b_1739879834.jpg',
        description: 'Вершково-сирна піца зі слабосоленим філе лосося, сири Моцарела та Пармезан, шпинат, томати чері',
    },
    {
        id: 2,
        name: 'Піца Трюфельна з грибами (460г)',
        price: 259,
        img: 'https://mafia.ua/storage/image-storage/2025/02/18/94987/source/450x450/2906806f-8079-4f2f-b980-f317ad75c37d_1739879787.jpg',
        description: 'Сир Моцарела, печериці, соуси вершково-трюфельний та часниковий',
    },
    {
        id: 3,
        name: 'Піца Мафія (570г)',
        price: 399,
        img: 'https://mafia.ua/storage/image-storage/2025/02/18/94763/source/450x450/8c298caa-bd95-45b7-9bc3-66d911926446_1739879511.jpg',
        description: 'Карбонара: шинка, грудинка, сир Пармезан, печериці, томати чері та вершки. Супер м\'ясна: філе куряче sous-vide, шинка, ковбаски мисливські, пепероні, сир Моцарела, печериці, цибуля, петрушка та соус BBQ. Чотири сири: сир Дор блю, сир Чеддер, сир Пармезан, груша, горіх волоський та вершковий соус, сирний бортик.',
    },
    {
        id: 4,
        name: 'Піца Карбонара (500г)',
        price: 349,
        img: 'https://mafia.ua/storage/image-storage/2025/02/18/94760/source/450x450/f05b514b-2835-493a-aa4a-92d50f77b17f_1739879508.jpg',
        description: 'Сир моцарела, шинка, грудинка, печериці, пармезан, томати чері та трюфельна олія.',
    },
    {
        id: 5,
        name: 'Піца Маргарита (445г)',
        price: 219,
        img: 'https://mafia.ua/storage/image-storage/2025/02/18/94761/source/450x450/e0f6bd4d-9d26-485f-96b8-ce94e0ae6afb_1739879509.jpg',
        description: 'Сир Моцарела, помідори, соус песто та маринара.',
    },
    {
        id: 6,
        name: 'Піца Пепероні new (450г)',
        price: 319,
        img: 'https://mafia.ua/storage/image-storage/2025/02/18/94762/source/450x450/3620169d-781b-439f-97b0-8036963d9165_1739879510.jpg',
        description: 'Пепероні, сир моцарела, сир пармезан, болгарський перець, чебрець, соус маринара.',
    },{
        id: 7,
        name: 'Піца Супер м\'ясна (570г)',
        price: 369,
        img: 'https://mafia.ua/storage/image-storage/2025/02/18/94764/source/450x450/34c50397-af3a-4e46-90b2-19333c8b51dd_1739879512.jpg',
        description: 'Філе куряче sous-vide, шинка, мисливські ковбаски, пепероні, сир моцарела, печериці, цибуля ріпчаста, петрушка, соус BBQ та трюфельна олія.',
    },
    {
        id: 8,
        name: 'Піца Чотири сири (430г)',
        price: 319,
        img: 'https://mafia.ua/storage/image-storage/2025/02/18/94765/source/450x450/841de0b6-f3a1-40bc-ad7c-081decbc3184_1739879512.jpg',
        description: 'Сир дор блю, сир чеддер, сир пармезан, сир моцарела, груша, горіх волоський, вершковий соус та трюфельна олія.',
    },{
        id: 9,
        name: 'Дабл м\'ясна (810г)',
        price: 729,
        img: 'https://mafia.ua/storage/image-storage/2025/02/18/95003/source/450x450/ce09369c-2f5e-4f55-a2a0-6ceff6ddb19c-1_1739879802.jpg',
        description: 'Філе куряче sous-vide, шинка, мисливські ковбаски, пепероні, сир Моцарела, печериці, петрушка, цибуля ріпчаста, соус BBQ та трюфельна олія',
    }];

